[
  {
    "name":"Prof. (Dr.) H.M. Suryawanshi",
    "rank":"Director, NIT Hamirpur",
    "description":"Patron",
    "img":"https://nith.ac.in/uploads/topics/hms16438810105577.jpg",
    "message":""
  },
  {
    "name":"Prof. (Dr.) RK Dutta",
    "rank":"NIT Hamirpur",
    "description":"Organizing Chairman",
    "img":"https://portfolios.nith.ac.in/uploads/member_details/46.jpg",
    "message":"Advances in Marketing Paradigms for Research, Innovation, and Technology is the title of an academic and scholastic event hosted by the Department of Management Studies at the National Institute of Technology Hamirpur (AMRIT-2023). This event aims to demonstrate how management concepts, philosophies, and etiquette have evolved over the past one decade, while technology and innovation have assumed centre stage. Given that management education is central to the majority of business practises in the post-Covid era, there is an urgent need to reevaluate the current curriculum. As a result, AMRIT-2023 aims to provide students, researchers, academics, and practitioners in the fields of management and social science from across the nation with an exceptional opportunity to share their findings regarding the most recent advancements in marketing research, innovation, and technology. AMRIT-2023 will become one of the most anticipated academic conferences among researchers, academics, and practitioners in the field. This event promises to be a turning point in NITH's efforts to foster research excellence, and I eagerly anticipate it. I extend my fondest wishes towards AMRIT-2023."
  },
  {
    "name":"Dr. Shampy Kamboj",
    "rank":"NIT Hamirpur",
    "description":"Organizing Secretary",
    "img":"https://portfolios.nith.ac.in/uploads/member_details/357.jpg",
    "message":"The marketing domain has embraced technology to adapt to the ever-changing dynamics of business. The AMRIT-2023 National Conference will help businesses gain a competitive edge and lead in an ever-changing industry ecosystem. Furthermore, AMRIT-2023 brings together leading experts, practitioners, and academics from the marketing & technology ecosystem - brand agencies, digital marketing, cutting-edge technology, marketers, technology evangelists, and experts, powering the next generation of marketing. We expect that all submissions must be of high quality, rigorous, and novel in their approach from the allied domains of management and technology.We extend our heartfelt thanks to the Patron, Chairman, Dean (FW), NITH and registrar NITH for allowing us to organize AMRIT-2023 with in a such a short span of time. The marketing domain has embraced technology to cope with the ever-changing dynamics of the business. \" Advances in marketing paradigms for research, innovation & technology \" would assist businesses develop their competitive edge and lead in the ever-changing industry ecosystem. Further AMRIT-2023 brings together leading experts, practitioners, and academicians in the marketing & technology ecosystem - brand agencies, digital agencies, new age technology companies, marketers, technology evangelists, experts, and platforms powering the next generation of the Marketing and other allied domains. We expect all submissions to be reach in quality, rigorous and novel in its approach from allied domains of management and technology."
  },
  {
    "name":"Dr. Mohd. Adil",
    "rank":"NIT Hamirpur",
    "description":"Organizing Secretary",
    "img":"https://portfolios.nith.ac.in/uploads/member_details/141.jpg",
    "message":"The marketing domain has embraced technology to adapt to the ever-changing dynamics of business. The AMRIT-2023 National Conference will help businesses gain a competitive edge and lead in an ever-changing industry ecosystem. Furthermore, AMRIT-2023 brings together leading experts, practitioners, and academics from the marketing & technology ecosystem - brand agencies, digital marketing, cutting-edge technology, marketers, technology evangelists, and experts, powering the next generation of marketing. We expect that all submissions must be of high quality, rigorous, and novel in their approach from the allied domains of management and technology.We extend our heartfelt thanks to the Patron, Chairman, Dean (FW), NITH and registrar NITH for allowing us to organize AMRIT-2023 with in a such a short span of time. The marketing domain has embraced technology to cope with the ever-changing dynamics of the business. \" Advances in marketing paradigms for research, innovation & technology \" would assist businesses develop their competitive edge and lead in the ever-changing industry ecosystem. Further AMRIT-2023 brings together leading experts, practitioners, and academicians in the marketing & technology ecosystem - brand agencies, digital agencies, new age technology companies, marketers, technology evangelists, experts, and platforms powering the next generation of the Marketing and other allied domains. We expect all submissions to be reach in quality, rigorous and novel in its approach from allied domains of management and technology."
  },
   {
    "name":"Dr. Vivek Tiwari",
    "rank":"NIT Hamirpur",
    "description":"Treasurer",
    "img":"https://portfolios.nith.ac.in/uploads/member_details/140.jpg",
     "message":""
  }
]
